app/controllers/codes_controller.rb

SELECT  `codes`.* FROM `codes`  ORDER BY created_at DESC LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM `codes`
SELECT `users`.* FROM `users` WHERE `users`.`id` IN (2)
---
  def index
    @codes = Code.includes(:user).page(params[:page]).per(5).order("created_at DESC")

INSERT INTO `codes` (`name`, `image`, `text`, `created_at`, `updated_at`) VALUES ('kazu', 'https://tech-master.s3.amazonaws.com/uploads/curriculums/images/Rails1-4/sample.jpg', 'konnniti', '2017-02-25 04:00:05', '2017-02-25 04:00:05')
---
  def create
    Code.create(image: code_params[:image], text: code_params[:text], user_id: current_user.id)

SELECT  `codes`.* FROM `codes` WHERE `codes`.`id` = 8 LIMIT 1
DELETE FROM `codes` WHERE `codes`.`id` = 8
---
  def destroy
    code = Code.find(params[:id])
    code.destroy if code.user_id == current_user.id

SELECT  `codes`.* FROM `codes` WHERE `codes`.`id` = 5 LIMIT 1
---
  def edit
    @code = Code.find(params[:id])

SELECT  `codes`.* FROM `codes` WHERE `codes`.`id` = 5 LIMIT 1
UPDATE `codes` SET `text` = 'こんにちは。ありがとう', `updated_at` = '2017-02-25 14:36:25' WHERE `codes`.`id` = 5
---
  def update
    code = Code.find(params[:id])
    if code.user_id == current_user.id
      code.update(code_params)

SELECT  `codes`.* FROM `codes` WHERE `codes`.`id` = 5 LIMIT 1
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1  ORDER BY `users`.`id` ASC LIMIT 1
SELECT `comments`.* FROM `comments` WHERE `comments`.`code_id` = 5
---
  def show
    @code = Code.find(params[:id])
    @comments = @code.comments.includes(:user)