app/controllers/comments_controller.rb

  def create
    @comment = Comment.create(text: comment_params[:text], code_id: comment_params[:code_id], user_id: current_user.id)
---
INSERT INTO `comments` (`text`, `code_id`, `user_id`, `created_at`, `updated_at`) VALUES ('ありがとう', 5, 1, '2017-02-26 04:52:34', '2017-02-26 04:52:34')