app/controllers/users_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 2  ORDER BY `users`.`id` ASC LIMIT 1
SELECT  `codes`.* FROM `codes` WHERE `codes`.`user_id` = 2  ORDER BY created_at DESC LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM `codes` WHERE `codes`.`user_id` = 1
---
  def show
    user = User.find(params[:id])
    @nickname = user.nickname
    @codes = user.codes.page(params[:page]).per(5).order("created_at DESC")